In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [3]:
s1 = Series(np.arange(3),index = ["a","b","c"])
s1

a    0
b    1
c    2
dtype: int32

In [5]:
s1.drop("b")

a    0
c    2
dtype: int32

In [9]:
df = DataFrame(np.arange(9).reshape((3,3)),index = ["SF","LA","NY"],columns = ["pop","size","year"])
df

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [13]:
df.drop("LA")

    pop  size  year
SF    0     1     2
NY    6     7     8

In [15]:
df

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [17]:
df2 = df.drop("LA")
df2

    pop  size  year
SF    0     1     2
NY    6     7     8

In [19]:
df

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [21]:
df.drop("year",axis = 1)

    pop  size
SF    0     1
LA    3     4
NY    6     7